{
    "red": {
        "title": "빨강 - 열정과 에너지",
        "description": "빨강을 선택한 당신은 강한 열정과 높은 에너지 수준을 가지고 있습니다. 도전적인 상황에서도 주도적으로 나서며, 목표를 향해 끈기 있게 나아갑니다. 당신은 타인에게 긍정적인 영향을 미치며, 리더십을 발휘하는 데 능숙합니다. 빨강은 당신의 내면에 불타는 의지와 결단력을 상징하며, 항상 새로운 도전을 추구하는 모습을 보여줍니다. 또한, 빨강은 당신이 감정적으로도 강렬하고 직설적인 성향을 가지고 있음을 나타냅니다.",
        "psychological_traits": [
            "높은 에너지 수준",
            "결단력과 자신감",
            "강한 의지와 목표 지향적"
        ],
        "advice": "당신의 열정을 잘 활용하여 새로운 프로젝트에 도전해 보세요. 하지만 때로는 휴식을 취하며 에너지를 재충전하는 것도 중요합니다. 감정을 조절하고, 과도한 열정이 주변 사람들에게 부담을 주지 않도록 주의하세요.",
        "image": "images/red.png"
    },
    "blue": {
        "title": "파랑 - 평온과 안정",
        "description": "파랑을 선택한 당신은 평온함과 안정감을 중요시합니다. 감정을 잘 조절하며, 타인과의 조화로운 관계를 유지하려는 노력을 기울입니다. 신뢰할 수 있고 책임감 있는 성격으로, 주변 사람들에게 신뢰를 줍니다. 파랑은 당신의 내면 깊은 곳에 있는 차분함과 사려 깊음을 반영하며, 언제나 안정된 마음으로 상황을 바라봅니다. 또한, 파랑은 당신이 논리적이고 분석적인 사고를 선호하며, 문제 해결에 있어서도 체계적인 접근을 취함을 나타냅니다.",
        "psychological_traits": [
            "높은 감정 조절 능력",
            "신뢰와 안정성",
            "협력적이고 배려심 깊음"
        ],
        "advice": "당신의 안정적인 성향을 활용하여 팀 프로젝트에서 중요한 역할을 맡아 보세요. 또한, 때때로 자신의 감정을 표현하는 것도 균형을 이루는 데 도움이 됩니다. 스트레스 상황에서도 침착함을 유지하며 문제를 해결하려는 노력을 계속하세요.",
        "image": "images/blue.png"
    },
    "yellow": {
        "title": "노랑 - 낙천주의와 창의성",
        "description": "노랑을 선택한 당신은 밝고 낙천적인 성격을 가지고 있습니다. 창의적인 아이디어를 잘 떠올리며, 새로운 것을 배우는 데에 열정적입니다. 주변 사람들에게 긍정적인 에너지를 전파하며, 항상 밝은 미래를 향해 나아갑니다. 노랑은 당신의 내면에 숨겨진 창의성과 호기심을 상징하며, 새로운 도전에 대한 두려움 없이 뛰어드는 모습을 보여줍니다. 또한, 노랑은 당신이 사교적이고 외향적인 성향을 가지고 있음을 나타내며, 사람들과의 상호작용을 즐깁니다.",
        "psychological_traits": [
            "높은 창의성과 상상력",
            "낙천적이고 긍정적인 태도",
            "학습과 성장을 추구"
        ],
        "advice": "당신의 창의성을 발휘할 수 있는 예술적 활동이나 새로운 취미를 시도해 보세요. 또한, 자신의 아이디어를 실현할 수 있는 환경을 찾아보는 것도 좋습니다. 낙관적인 태도를 유지하며, 어려운 상황에서도 긍정적인 면을 찾아보세요.",
        "image": "images/yellow.png"
    },
    "green": {
        "title": "녹색 - 균형과 조화",
        "description": "녹색을 선택한 당신은 균형과 조화를 중요시합니다. 자연과의 연결을 느끼며, 내면의 평화를 추구합니다. 타인과의 관계에서 조화롭게 소통하며, 협력적인 태도를 보입니다. 녹색은 당신의 내면 깊은 곳에 있는 평온함과 균형감을 반영하며, 항상 조화로운 삶을 유지하려는 노력을 보여줍니다. 또한, 녹색은 당신이 실용적이고 안정적인 성향을 가지고 있으며, 문제 해결에 있어서도 신중하고 체계적인 접근을 취함을 나타냅니다.",
        "psychological_traits": [
            "높은 조화와 균형 감각",
            "내면의 평화 추구",
            "협력적이고 배려심 깊음"
        ],
        "advice": "자연과의 시간을 늘리며 스트레스를 관리하세요. 또한, 자신의 감정을 솔직하게 표현함으로써 대인 관계에서 더욱 깊은 유대를 형성할 수 있습니다. 균형을 유지하며 일과 삶을 조화롭게 관리하려는 노력을 계속하세요.",
        "image": "images/green.png"
    },
    "purple": {
        "title": "보라 - 창의성과 영감",
        "description": "보라를 선택한 당신은 창의적이고 영감을 잘 받는 사람입니다. 독창적인 사고를 바탕으로 새로운 아이디어를 창출하며, 예술적인 감각이 뛰어납니다. 깊이 있는 사고와 직관을 통해 문제를 해결하며, 항상 새로운 가능성을 탐구하려는 열정을 가지고 있습니다. 보라는 당신의 내면에 있는 창의성과 영감을 상징하며, 혁신적인 아이디어를 실현하기 위해 끊임없이 노력하는 모습을 보여줍니다. 또한, 보라는 당신이 감성적이고 직관적인 성향을 가지고 있음을 나타냅니다.",
        "psychological_traits": [
            "높은 창의성과 상상력",
            "영감과 직관",
            "독창적이고 혁신적 사고"
        ],
        "advice": "예술적 활동이나 창의적인 프로젝트에 참여해 보세요. 자신의 아이디어를 실현할 수 있는 공간을 마련하면 더욱 큰 성과를 이룰 수 있습니다. 또한, 영감을 받을 수 있는 다양한 경험을 추구하며 창의적인 사고를 지속적으로 발전시키세요.",
        "image": "images/purple.png"
    },
    "black": {
        "title": "검정 - 권위와 안정",
        "description": "검정을 선택한 당신은 권위적이고 안정적인 성격을 가지고 있습니다. 책임감이 강하며, 신뢰할 수 있는 사람으로 인식됩니다. 목표를 향해 꾸준히 나아가며, 어려운 상황에서도 침착함을 유지합니다. 검정은 당신의 내면에 있는 강한 의지와 안정감을 상징하며, 언제나 자신감을 가지고 상황을 대처하는 모습을 보여줍니다. 또한, 검정은 당신이 논리적이고 분석적인 사고를 선호하며, 문제 해결에 있어서도 체계적인 접근을 취함을 나타냅니다.",
        "psychological_traits": [
            "높은 책임감과 신뢰성",
            "권위적이고 리더십",
            "침착함과 안정성"
        ],
        "advice": "리더십을 발휘할 수 있는 역할을 맡아 보세요. 또한, 자신의 감정을 표현하는 연습을 통해 더 나은 대인 관계를 형성할 수 있습니다. 책임감을 가지고 맡은 일을 성실히 수행하며, 다른 사람들과의 협력을 통해 더욱 큰 성과를 이루세요.",
        "image": "images/black.png"
    },
    "white": {
        "title": "흰색 - 순수함과 명료성",
        "description": "흰색을 선택한 당신은 순수함과 명료함을 중요시합니다. 깨끗하고 간결한 환경을 선호하며, 투명한 소통을 중시합니다. 새로운 시작과 변화를 긍정적으로 받아들이며, 자기 계발에 열정적입니다. 흰색은 당신의 내면에 있는 순수함과 명료한 사고를 상징하며, 항상 새로운 도전을 향해 나아가는 모습을 보여줍니다. 또한, 흰색은 당신이 조직적이고 체계적인 성향을 가지고 있음을 나타내며, 문제 해결에 있어서도 논리적이고 분석적인 접근을 취함을 의미합니다.",
        "psychological_traits": [
            "높은 명료성과 조직력",
            "순수함과 깨끗함 추구",
            "새로운 시작과 변화에 열린 태도"
        ],
        "advice": "자신의 목표를 명확히 설정하고 체계적으로 계획을 세워 보세요. 또한, 새로운 도전을 두려워하지 않고 적극적으로 시도하는 것이 도움이 됩니다. 깨끗하고 정돈된 환경을 유지하며, 명료한 사고로 문제를 해결하려는 노력을 계속하세요.",
        "image": "images/white.png"
    }
}
